{
  "welcome": {
    "greet": "来自Echosoul最诚挚的问候",
    "chapter-title": "一 · 欢迎",
    "chapter-blurb": "铁门微启，第三道影尚未入席；请把笑意留到风数到二之后。",
    "p01": "在很久很久以前——在月亮学会用侧脸窥探、乌鸦练就三声克制的咳嗽之前——这座镇子就吊着一块歪斜的木牌：",
    "p02": "“欢—迎—光—临”。",
    "p03": "缺口像被牙齿咬走的一块黑，正好能塞进一个不想被提起的名字。镇民说那木头自己会走路；镇长说经费而已；铁匠把脸埋到火里，只回了一句：我只修会咬人的门闩。",
    "p04": "今晚，铁门的花纹像藤蔓结成的网，恰好盖住你的胸口。门后是一条灰白的路，末端窝着一片田；田中央立着稻草人，眼睛是两颗被霜冻过的橘黄玻璃，风一停就把光折回来戳你。别怕——据不可靠的统计，那只是折射。至于谁做的统计？他把新地址写成了“离稻草人更远一点”。",
    "p05": "你的手电很老，像是从谁的梦里借来的。它有三种状态：不开，忽明忽暗，以及只在要紧时亮得体面——通常只撑到你“哇——”的长音落下。手柄上刻着细字：若见第三道影，请微笑。你照做了，于是墙上爬出第一道影与第二道影，第三道始终不至，像一个守规矩的客人，在门外站定，等你先开口。",
    "p06": "门柱上的铃铛锈得像四季生了病。你轻碰，它“叮”地响，声线干净得不近人情，把寂静从中间剖开。右侧的石柱上，乌鸦缩着脖子，像个黑色的病句，只咳了三下。有人私下里说，这里的“三”不太对劲：第三盏路灯下埋着纽扣，第三条小径通向磨坊的地下室，而第三次回头的人，常会在肩胛骨之间听见自己的名字被风反复试读。",
    "p07": "你把门推开一条缝。缝里溢出潮湿的谷香——不是收成，是记忆，像被晒干的秋天被人折成书签，夹在一本讲究的历史里。地上的积水把月亮摁扁成一张银色地图，路线模糊，箭头却热情，指向那片田。你把犹豫和零钱一并塞进口袋，摸出一张被汗水泡软的纸角，上书“E 留”；翻到背面，潦草添着三字：别回头。写字的人显然不认识你——你向来尊重叮嘱，但更爱亲自拆封它们。",
    "p08": "栅栏每隔几步就少一根，像有人数到一半忘了呼吸。缺口里一丛老菊仰着脸，花瓣围着中心打旋，仿佛在等谁报数。风自田里吹来，吹皱月光，顺带把稻草人的袖口轻轻举起——像在客气地点头，也像在丈量你的身高。",
    "p09": "“欢迎。”",
    "p10": "声音从谷堆的深处筛落，像细沙穿过骨缝。你四下看，只见一张掉色的海报贴在门背，画着旧年的丰收节：彩带、南瓜、笑脸。最底下一行字细得像针：",
    "p11": "切勿与模仿人类的装置对视超过三秒。",
    "p12": "旁边新贴的补丁纸写：若不慎对视，请先数到二，再打喷嚏。补丁纸的边角卷着，小小地抽搐，像一只将醒未醒的眼。",
    "p13": "你把手电举高。光束在铁门卷草上碎开，像一朵迟到的向日葵。只消往前走三十步，你就会抵达传说的根——别人故事的尾。这里，“结束”一词十分礼貌，它会把位置让给“开始”，并请你看好脚下。",
    "p14": "稻草人仍旧一动不动。正当风停的短促空隙里，你听见一种轻得几乎要裂开的声音——像纸从书脊剥落，像指甲从木头里抽出。一个没有来由的句子贴在你耳后：",
    "p15": "“借我你的影子，用你的名字打个结。到第三次月圆，我把一枚纽扣还你——换成一扇门。”",
    "p16": "你闻见麦秸里藏着生锈的甜味，鼻腔里缓慢开出一个尚未做出的决定。规矩要你给出两个选择：",
    "p17": "A. 把手电调到“体面”，沿田埂前行，假装你不知道“三”的规矩——别看影子，别数心跳。",
    "p18": "B. 回头，从门缝里掏出那块缺失的木牌，看看背面是否也刻着“E 留”，再把它插回去，等它自己决定掉落的时辰。",
    "p19": "不要问答案。我的工作是把门推开，把椅子放在影子里，再把一盏不听话的手电摆在你伸手够得着的地方。你要坐还是站，随你。只要记得——当第三道影终于走进来，请微笑。",
    "p20": "因为在这镇子里，笑意是一枚被磨得很薄的护身符，薄到只能抵挡一次目光、一次名字、一次门闩轻响。很多很多年前，有人靠着它活过来；而很快很快之后，你会明白：有些门并不是开了——而是你被它安静地迎了进去。",
    "author": "策划/剧情：传闻中的璃音",
    "code": "代码/UI: Fellsoul",
    "map": "地图/场景：范ander"
  },
    "manual": {
      "greet": "游玩须知",
      "chapter-title": "二 · 使用说明",
      "chapter-blurb": "这是恐怖游戏。真的会吓人。请对自己的心脏、显示器和邻居的耳朵负责。",
      "p01": "本作属于恐怖/惊悚类型，包含突然惊吓、压抑氛围与令人不安的声音设计。若你不确定能否承受，请先深呼吸，再考虑进入。",
      "p02": "重要健康提示：对光敏感的玩家、癫痫患者或曾有相关病史者，严禁游玩。我们不需要‘真实到叫救护车’的沉浸感。",
      "p03": "本游戏仍在制作中。换句话说：我们在一边铺路一边请你试着开车。可能会遇到坑，但我们正在努力把坑变成风景。",
      "p04": "当前版本的内容、机制与难度会持续迭代。你的反馈就像手电筒的电池——让我们看清下一步在哪里。",
      "p05": "可能出现的情况：画面闪烁、强光/频闪、突然音量变化、AI非理性热情、以及你自己发出的声音。",
      "p06": "建议使用耳机、在安静环境游玩，并把音量调到‘能吓到你但吓不到楼上阿姨’的程度。",
      "p07": "若感到不适（头晕、恶心、心跳停止），请立刻暂停，移开视线并休息。勇敢不是硬撑到游戏结束。",
      "p08": "存档与进度：当前玩家信息存储仍在调试阶段，极少数情况下可能出现保存失败或进度回滚。我们在修",
      "p09": "操控说明：WASD移动，移动端用摇杆。若你的手指天生排布和我们不同，那尝试用其他人的手指试试。",
      "p10": "网络与隐私：若开启在线功能，基本的匿名统计会被上传，用来帮助我们优化。我们不关心你早餐吃了啥，只关心你在哪一步被吓到退了游戏。",
      "p11": "设备要求：请确保显卡驱动不是上古化石，且系统有足够空间存放我们的恐惧（以及贴图）。",
      "p12": "外挂与Bug：前者会破坏体验，后者会破坏沉浸。我们反对前者，欢迎上报后者。",
      "p13": "适龄提示：建议年满16岁游玩。若你未成年，请在监护人同意下进行，并把音量调小一点点。",
      "p15": "在评论区留言。描述越具体，Fellsoul掉的头发就越有价值。",
      "p16": "安全词（玩笑的）：当你觉得害怕到需要拥抱，请按关机键。它比门后的任何东西都可靠。",
      "p17": "免责声明：游玩风险自负。我们提供的是体验，不是医疗级心率训练。",
      "p18": "温馨提示：请不要在半夜戴着降噪耳机、背后留一扇开着的门进行游玩——除非你想获得‘真实环绕声’。",
      "p19": "最后：谢谢你的耐心和勇气。你每一次继续前行，都在帮助我们把这片田地变成真正的世界。",
      "p20": "祝你好运。遇到第三道影时——请微笑，然后继续走。"
    },
    "world": {
      "greet": "汝身在何方？",
      "chapter-title": "三 · 世界观",
      "chapter-blurb": "中世纪影子里的另一个欧洲：雾、暗绿的森林、与每年10月31日准时响起的传说。",
      "p01": "时代背景取材于欧洲中世纪，但并非真实历史。这里是平行的乡野与王权之外的地带，常年被浓雾包围，月光像被滤过的铁屑，冷而薄。",
      "p02": "一座村庄依林而建，旁边是一片被称作“黑暗森林”的暗绿色林海。雾像旧毛毯一样搭在树冠上，白天遮光，夜里藏声。",
      "p03": "村里流传着稻草人的恐怖故事：每年10月31日，都会有儿童离奇失踪。为了保住灵魂，孩子们会在这天装扮成鬼怪；可也有传说，真正的怪物会混在他们中间。",
      "p04": "某年万圣节前夜，年幼的⬛️⬛️⬛️被一个稻草人引诱，悄悄跟进森林。⬛️⬛️⬛️的母亲眼尖，第一时间追了进去，在月光映亮镰刀的瞬间，她抱住孩子，替他挡下那一刀。",
      "p05": "鲜血溅在落叶上像一枚红色封印。母亲力竭倒下，远处传来村民呼喊与南瓜灯的光。稻草人只留下一把散落的干草，退回雾中。母亲性命无虞，却从此卧床，再也离不开那张床。",
      "p06": "（时间轴标注：此处“母亲”为⬛️⬛️⬛️之母；“孩子”为年幼的⬛️⬛️⬛️。⬛️⬛️⬛️的个人剧情发生在此事之后，文中其他传说多发生在此前。）",
      "p07": "一年之后，⬛️⬛️⬛️的父亲——一位举世闻名的森林探险家——发起讨伐。他与一支小队深入森林，包括：植物学家、古代文化学家、怪物研究学家、派对策划家、机械师、厨师等。",
      "p08": "他们进入森林后再无音讯。自此，怪物很少再混入人群诱骗孩子，但“黑暗森林”成为村里的禁忌之地。关于失踪者的讨论也被噤声，像被雾吞掉的钟声，只剩余震。",
      "p09": "这些失踪者的孩子仍记得那几道背影：在炉火与家门之间，他们选择走向森林深处。记忆像没写完的信，寄不出去，也撕不下去。",
      "p10": "几年过去，孩子们长大了：幼态退去，决心成形。父母的去向成了随年龄一起增长的谜团：他们在森林里遇到了什么？为何多年无消息？",
      "p11": "他们知道答案或许只在万圣节出现——于是决定在10月31日这天、当全村沉浸在节日欢闹时，悄然再次踏入黑暗森林，去寻找遗落的线索与那群人的去向。",
      "p12": "半现实的中世纪乡野，恐怖与民俗叠加，雾与秩序对峙；每年的同一天，故事更新一章。森林不只是一处地点，更是一条通往真相与代价的路径。"
    },
    "theatre": {
      "greet": "孩子们的故事",
      "titles": [
        "植物家的孩子：艾米丽·格林伍德（Emily Greenwood）",
        "森林探险家的孩子：托马斯·霍桑（Thomas Hawthorne）",
        "古代文化学家的孩子：莉莉安·诺布尔（Lillian Noble）",
        "怪物研究学家的孩子：塞巴斯蒂安·莫尔（Sebastian Mohr）"
      ],
      "emily_greenwood": {
        "chapter-title": "四 · 植物学家的孩子",
        "p01": "“艾米丽，你看，这些种子的颜色和形状都不一样，看得出来吗？”\n\n“这个应该是南瓜。我看妈妈做南瓜派时，从南瓜里掏出来的就是这种。”",
        "p02": "“哈哈，不愧是格林伍德家的孩子！”\n\n“当然，我们家艾米丽最聪明了，对吧？”\n\n“嗯！我最喜欢看植物长大的样子了！”",
        "p03": "“乖女儿，你也会像种子一样长成参天大树。”\n\n“爸爸，参天大树是什么树呀？”\n\n“那就看你喜欢什么树了。”",
        "p04": "“嗯……我喜欢黑暗森林那种树！村里从来没有过那种奇奇怪怪的树呢。”\n\n“黑暗森林……确实，那里的树跟这里的不一样。”",
        "p05": "“不过，世界上还有别的树不感兴趣吗？”\n\n“喜欢呀，但我想像爸爸一样研究它们的‘魔力’！”\n\n“哈哈，我相信你一定可以。”"
      },
      "thomas_hawthorne": {
        "chapter-title": "森林探险家的孩子 · 托马斯",
        "p01": "“哈……哈……跑起来！想象你身后有怪物！”\n“太累了，爸爸……我想休息一下……”",
        "p02": "“休息？黑暗森林里的怪物会让你休息吗？跑不动再加一圈！”\n“可是爸爸，我见过它！我从它魔爪里逃出来了！”",
        "p03": "“那只是跑出来。你要学会对付它。我不指望你打败它，但我不希望你像你妈妈那样全身瘫痪。听懂了吗？”\n“好……”",
        "p04": "“这才对。爸爸这辈子的经历都会教给你\n做能守护别人的探险家，而不是让他们暴露在危险中。”\n“我会努力锻炼的。”",
        "p05": "“今晚做你最爱吃的肉酱面。双倍肉酱！”\n“好！多吃才能长大！”"
      },
      "lillian_noble": {
        "chapter-title": "古代文化学家的孩子 · 莉莉安",
        "p01": "“从古怪物从人类手中守护祭坛……因为——”\n“祭坛有对付它们的魔力。”",
        "p02": "“妈妈？你什么时候进来的？”\n“在你读到第三章第十四行的时候。”\n“你怎么知道？”\n“那本书是我写的。”",
        "p03": "“我当然记得，只是……有时候觉得妈妈的记忆太‘古怪’了。”\n“我们不就是研究‘古怪’吗？”",
        "p04": "“等我长大了就研究妈妈好了。”\n“喂喂，妈妈可不是研究对象！”\n“只是觉得你脑袋和木乃伊很像。”\n“你是指我像法老一样聪明？”",
        "p05": "“可能是吧。”\n“什么叫可能是啊喂！”\n“开玩笑的。你比我聪明多了；要是哪天我研究出新文明，也离不开你。”"
      },
      "sebastian_mohr": {
        "chapter-title": "怪物研究学家的孩子 · 塞巴斯蒂安",
        "p01": "“塞巴斯！你又躲去哪了？”——“啧，烦人。”——“我就知道你藏在这！你每天不学习跑出来干什么？”",
        "p02": "“我也想知道你每天跑出去做什么危险的事。”——“那是我的工作，你们小孩不懂。”——“不懂？全村都知道你是‘英雄’。”",
        "p03": "“你把自己暴露在森林危险里，从没想过我和妈妈的感受！”——“我研究它们是为了你们，不想你们像隔壁那位一样再也站不起来。”",
        "p04": "“不准你这么说他妈妈！他是我朋友！”——“他们不懂怪物却面对怪物，待在村里才安全。”——“我不赞同，他一直为保护妈妈努力。”",
        "p05": "“那你呢？该一起保护村庄。恐惧让他站起来面对；而你在逃避。变强，磨练自己，成为强韧的木刀，而不是无用的腐木。”"
      }
    },
    "kids": {
      "greet": "小英雄，今夜你发光吗？",
      "chapter-title": "五 · 孩子阵营玩法",
      "chapter-blurb": "主线目标很简单：把南瓜从“种子”一路折腾成“会发光的头”，再把三个头恭敬地请到祭坛上——顺序别反了。",
      "p01": "流程总览（安全但不保证心理舒适）：干草堆→温室→雕刻台→点火台→祭坛×3→胜利。箭头不是装饰，跟着走就行。",
      "p02": "第一步·干草堆：把手伸进毛茸茸的未知里，翻找南瓜种子。正常情况下你会摸到种子；异常情况下你会摸到不是你的手——放心，那通常是同伴的。",
      "p03": "专业提示：⬛️⬛️⬛️“绿手指”在此大显身手。她挑的种子更会长，时间还短一点。其他人也能找，但效率与心理阴影面积成正比。",
      "p04": "第二步·温室催熟：把种子安置进温室，让它飞速成长。温室是全村最温柔的地方——除了偶尔从玻璃外探进来的稻草影子。保持安静，别让植物听见你在长。",
      "p05": "温室小心机：若触发“专注检定”，别慌——通过了，你像浇了鸡汤；没通过，植物像喝了你的鸡汤。⬛️⬛️⬛️在这一步能减少突发状况。",
      "p06": "第三步·雕刻台：把成熟南瓜雕出脸。尽量笑得可爱一些，别把它刻成你数学老师。雕刻时注意血量——不是南瓜的，是你的。",
      "p07": "艺术总监友情提醒：⬛️⬛️⬛️认识一些古怪的符号。刻在南瓜上或许会更亮……或许会让它开始讲话。两者都很有节日氛围。",
      "p08": "第四步·点火台：给南瓜点上灵魂之火。火焰颜色健康得像刚做完体检，温度恰好，能照亮路也能暴露你。请在点亮后迅速移动，避免成为灯塔。",
      "p09": "运输学：点亮的南瓜灯容易吸引“巡逻型友人”。⬛️⬛️⬛️追踪强、跑得悄，适合运灯；⬛️⬛️⬛️万一被逮到，可能闪一下——闪不掉就跑得更快。",
      "p10": "第五步·祭坛献祭：把南瓜灯安置在祭坛凹槽里，听见“咔哒”一声就是对了。每次献祭都会让森林咳嗽一声，别理它。集齐三盏，门会自己开（不保证通向好地方）。",
      "p11": "团队协作：一人搬灯、一路放哨、一路清路。看见稻草人不要对视——它的眼神像作业截止日，你越看越不会动。",
      "p12": "胜利条件：三盏南瓜灯安然就位，祭坛启动，夜风变甜，村口的钟声比你心跳慢半拍——这意味着活着的你们赢了。再补一句：赢了不代表安全，安全只是今晚的别名。",
      "p13": "失败示例（用于练习笑对人生）：南瓜在半路被踩爆；点火时把自己点着；祭坛前排队忘记排在同一条时间线上。别担心，练到第三把都会变成佳话。",
      "p14": "最后的胆小贴士：遇事先笑，笑完再跑；听见稻草在耳边响，说明它离你很近——这时请夸它发型。礼貌，有时比速度更有用。"
    },
    "overseer": {
      "greet": "夜已就位。你也该就位。",
      "chapter-title": "六 · 怪物阵营玩法",
      "chapter-blurb": "稻草人不追。\n稻草人只等。\n等在正确的位置。\n等在正确的时刻。\n看见物品。\n判断去向。\n提前在路上化成影子。\n\n唯有如此\n稻草才能永存。",
      "p01": "流程图不属于他们，也不属于你——它属于夜晚。你只负责在每一处必经之点上，像钉子一样冷。",
      "p02": "听觉为先：干草的窸窣、玻璃的回声、刀刃刮皮的砂响、火焰吞气的低喉、祭坛的锁舌——都在告诉你，下一步在哪里。",
      "p03": "守点一·干草堆：若夜里首先响起‘刷刷’的毛边声，孩子在摸种子。站在退路处，不在正面。让他们带着恐惧离开，再带着恐惧回来。",
      "p04": "守点二·温室：玻璃微颤，雾气碎开。那不是风，是成长。停在门框的影子里，等专注失败的那一瞬。有人会抬头，他们只会看到你第二次眨眼。",
      "p05": "守点三·雕刻台：刀与南瓜皮会唱一首细长的歌。歌声越稳，心越急。靠近，不要打断，让他们自己割出破绽，然后再收割。",
      "p06": "守点四·点火台：火点起的瞬间会吞一口空气。那就是号角。火光让他们看见路，也让你看见他们。不要急，光会替你驱散他们的藏身处。",
      "p07": "守点五·祭坛：所有脚步最终都指向这里。三次‘咔哒’之前，任何一次犹豫都是裂缝。站在‘咔’与‘哒’之间。",
      "p08": "搬运识别：空手的人会看地面，抱灯的人会看黑暗。看他们的肩——沉的一侧指向下一个地点。看他们的脚——谨慎的步幅说明手里有光。",
      "p09": "路径推断：干草→温室→雕刻→点火→祭坛。若在任一环节被打断，下一次他们会选择更短的路线、更亮的路、更近的同伴。把你的影子放在那些‘更’上。",
      "p10": "巡逻法则：只在两点之间来回，别在三点中犹豫。夜不喜欢摇摆。你是门闩，不是风铃。",
      "p11": "凝视（恐惧凝视）：选择抱灯者。让速度降下去，让心跳提上来。慢，就是告别。",
      "p12": "替身（稻草重生）：当他们以为成功时，留下一具空壳。你去别处。胜负总在他们回头的那一秒决定。",
      "p13": "诱捕：假退两步，留出狭缝。孩子会以为那是生路。让他们自己把灯送进你的怀里。",
      "p14": "清算：三盏灯若齐，你便失去今晚。打碎任何一盏，夜会替你补全其余的黑。",
      "p15": "警句：不要追，等他们奔向你。不要吼，听他们替你报点。不要仁慈，仁慈会生根抽芽，长成他们的明天。",
      "p16": "结语：守，是一种缓慢的斩首。当最后一声锁舌停下，森林会把你的名字写回雾里。只要你仍在正确的位置，明天就不会到来。",
      "p17": "木板：若孩子翻下木板阻拦，你可以踢碎。动作缓慢，声响刺耳，像把夜切成更薄的片。花费很久，但总会断。让他们明白——拖延只是把恐惧拉长。",
      "p18": "清扫：孩子随手乱丢的物品，你可以“打扫干净”。不是整理，是抹去。路径上的每一块道具都会消失，像没被放下过。让他们回头找不到手，向前找不到路。夜喜欢这种秩序。"
    },
    "design":{
      "greet": "比较不错的AI设计"
    },
    "future":{
      "greet": "明日寄语",
      "p01": "尝试给角色加上更丰富的技能（？ 但最好还是提升技能品质，让合作游戏玩起来更讲究配合一些",
      "p02": "Bug蛮多的，毕竟是3x48做出来的哈哈哈",
      "p03": "现在，我要去睡觉了。晚安（早上好）。"
    }
  
}
