{
  "welcome": {
    "greet": "The warmest greetings from Echosoul",
    "chapter-title": "I · Welcome",
    "chapter-blurb": "The iron gate parts a sliver; the third shadow has yet to take its seat. Please save your smile until the wind counts to two.",
    "p01": "Long, long ago—before the moon learned to peek with its profile and before the crows practiced a restrained, thrice-coughed rasp—this town already hung a crooked wooden sign:",
    "p02": "\"W-e-l-c-o-m-e.\"",
    "p03": "The missing chunk, as if bitten off by teeth, was a piece of black just big enough to wedge a name no one wished to mention. The townsfolk said the wood could walk by itself; the mayor said it was merely a budget issue; the blacksmith buried his face in the fire and replied only: I mend only the latches that bite.",
    "p04": "Tonight the ironwork on the gate weaves like vines into a net that perfectly covers your chest. Beyond the gate lies a gray road ending in a field; in its center stands a scarecrow with eyes like two frost-bitten amber marbles. When the wind pauses, it bends the light back to jab at you. Don't be afraid—according to unreliable statistics, it's only refraction. As for who compiled those statistics? He wrote his new address as \"A little farther from the scarecrow.\"",
    "p05": "Your flashlight is old, as if borrowed from someone's dream. It has three states: off, flickering, and the kind of proper brightness that appears only when needed—and usually holds out just until the long vowel in your \"waaah—\" falls. On the handle are tiny letters: If you see the third shadow, please smile. You do as told, and a first shadow and a second shadow climb the wall. The third never arrives, like a well-mannered guest standing outside the door, waiting for you to speak first.",
    "p06": "The bell on the doorpost is rusted as if all four seasons were ill. You touch it lightly; it gives a single \"ding,\" a tone so clean it's almost inhuman, cleaving the silence down the middle. On the right column a crow hunches its neck like a black grammatical error and coughs three times. Some whisper that the \"three\" here is not quite right: a button is buried under the third streetlamp, the third path leads to the mill's basement, and those who look back a third time often hear the wind testing their name between their shoulder blades.",
    "p07": "You push the door open a crack. Damp grain-scent spills out—not a harvest, but a memory, like an autumn sun-dried and folded into a bookmark and tucked inside a fastidious history. Puddles flatten the moon into a silver map on the ground, routes blurry but arrows eager, pointing toward the field. You stuff both your hesitation and your loose change into your pocket and feel out a sweat-softened scrap of paper cornered with the letters \"E 留\"; on the back, in a careless scrawl, three more words: Don't look back. The writer clearly doesn't know you—you respect cautions, but you prefer to unseal them yourself.",
    "p08": "The fence is missing a slat every few steps, as if someone forgot to breathe while counting. In one gap an old chrysanthemum tilts its face up, petals spinning round the center, as though waiting for the caller to count. Wind comes off the field, crinkling the moonlight and, in passing, lifting the scarecrow's cuff—like a courteous nod, or like measuring your height.",
    "p09": "\"Welcome.\"",
    "p10": "The voice sifts down from deep in the grainstack like fine sand passing a bone seam. You look around and see only a faded poster pasted to the back of the door, depicting last year's harvest festival: streamers, pumpkins, smiles. A thread-thin line at the bottom reads:",
    "p11": "Do not stare for more than three seconds at devices that imitate humans.",
    "p12": "A freshly pasted patch beside it says: If you stare by mistake, count to two first, then sneeze. The patch's corners curl, twitching a little, like an eye about to wake.",
    "p13": "You lift the flashlight high. The beam shatters on the iron scrollwork like a tardy sunflower. Just thirty steps forward will bring you to the root of legend—the tail of someone else's story. Here the word \"ending\" is very polite: it yields its seat to \"beginning\" and asks you to watch your step.",
    "p14": "The scarecrow still does not move. In the brief hollow when the wind stops, you hear a sound so light it is almost breaking—like paper peeling from a spine, like a nail withdrawing from wood. A sentence without a source sticks behind your ear:",
    "p15": "\"Lend me your shadow and tie a knot with your name. By the third full moon, I will return a button to you—in exchange for a door.\"",
    "p16": "You smell a rusty sweetness hidden in the straw; in your nose a decision not yet made begins to bloom. The rule bids you choose between two:",
    "p17": "A. Turn the flashlight to \"proper\" and follow the field ridge, pretending you do not know the rule of \"three\"—don't look at your shadow, don't count your heartbeat.",
    "p18": "B. Turn back, fish the missing plank from the door crack, check whether \"E 留\" is carved on its backside too, then slot it back in and wait for it to choose its own moment to fall.",
    "p19": "Do not ask for the answer. My job is to push the door open, set a chair where the shadow falls, and place a disobedient flashlight within your reach. Sit or stand—as you like. Only remember this—when the third shadow finally walks in, please smile.",
    "p20": "Because in this town, a smile is a talisman worn thin—thin enough to block a single gaze, a single name, a single click of the latch. Long, long ago, someone lived because of it; and very, very soon, you will understand: some doors are not opened—rather, you are quietly welcomed inside by them."
  },
  "manual": {
    "greet": "Before You Play",
    "chapter-title": "II · Instructions",
    "chapter-blurb": "This is a horror game. It really scares. Please be responsible for your heart, your monitor, and your neighbor’s ears.",
    "p01": "This work is horror/thriller, with jump scares, oppressive mood, and unsettling sound design. If unsure you can handle it, breathe first, then decide.",
    "p02": "Health warning: players with photosensitivity, epilepsy, or related history must not play. We do not need immersion that ends with an ambulance.",
    "p03": "The game is still in development. In other words: we’re paving the road while inviting you to try driving. There will be potholes; we’re working to turn them into scenery.",
    "p04": "Content, mechanics, and difficulty will keep iterating. Your feedback is our batteries—it lets us see the next step.",
    "p05": "You may encounter: flicker, strong lights/strobes, sudden volume changes, irrationally enthusiastic AI, and noises made by you.",
    "p06": "Use headphones in a quiet space and set volume to “scares you, not the upstairs aunt.”",
    "p07": "If unwell (dizzy, nauseous, heartbeat stops), pause immediately, look away, rest. Courage isn’t forcing yourself to the credits.",
    "p08": "Saves & progress: player-info storage is under debugging; in rare cases saves may fail or roll back. We’re fix",
    "p09": "Controls: WASD to move; joystick on mobile. If your fingers grow in a different layout than ours—try borrowing someone else’s.",
    "p10": "Network & privacy: with online features on, anonymous stats are uploaded to help optimization. We don’t care about your breakfast, only where you quit from fear.",
    "p11": "Requirements: keep GPU drivers out of the fossil age and leave enough space for our fear (and textures).",
    "p12": "Cheats & bugs: the former breaks fun; the latter breaks immersion. We oppose the first and welcome reports of the second.",
    "p13": "Age rating: 16+. If underage, play with guardian consent—and slightly lower volume.",
    "p15": "Leave a comment. The more specific, the more valuable the hair Fellsoul loses.",
    "p16": "Safe word (joking): if you need a hug, press the power button. It’s more reliable than anything behind the door.",
    "p17": "Disclaimer: play at your own risk. We provide an experience, not clinical heart-rate training.",
    "p18": "Tip: don’t play at midnight with noise-canceling headphones and an open door behind you—unless you want “true surround.”",
    "p19": "Finally: thanks for patience and bravery. Every step you take helps turn this field into a world.",
    "p20": "Good luck. When the third shadow appears—smile, then keep walking."
  },
  "world": {
    "greet": "Where do you stand?",
    "chapter-title": "III · Worldbuilding",
    "chapter-blurb": "Another Europe within the shadows of the Middle Ages: fog, dark-green forests, and a legend that rings on October 31 every year.",
    "p01": "Inspired by medieval Europe but not real history. This is a parallel countryside beyond crown and court, shrouded in fog; moonlight is iron filings sifted thin and cold.",
    "p02": "A village leans on the woods beside a dark-green sea called the “Black Forest.” Fog drapes the canopy like an old blanket—dims the day, hides the night.",
    "p03": "A scarecrow tale haunts the village: each October 31, children vanish. To keep their souls, they dress as monsters; some say the real monster hides among them.",
    "p04": "On one Halloween eve, young ⬛️⬛️⬛️ was lured by a scarecrow into the forest. ⬛️⬛️⬛️’s mother spotted it and rushed in. When moonlight flashed on the sickle, she embraced the child and took the blow.",
    "p05": "Blood on leaves sealed red like a stamp. The mother collapsed; from afar came shouts and the glow of jack-o’-lanterns. The scarecrow left only scattered straw and withdrew into the fog. The mother lived, but the bed kept her ever after.",
    "p06": "(Timeline note: “mother” here is ⬛️⬛️⬛️’s mother; “child” is young ⬛️⬛️⬛️. ⬛️⬛️⬛️’s personal plot occurs after this; other legends mostly before.)",
    "p07": "A year later, ⬛️⬛️⬛️’s father—a world-famous forest explorer—led a hunt. With him went a botanist, antiquity scholar, monster researcher, party planner, mechanic, chef, and others.",
    "p08": "They never returned. Since then, monsters seldom mingle with crowds to lure children, but the “Black Forest” became taboo. Talk of the missing was hushed, like a bell swallowed by fog—only aftershocks remain.",
    "p09": "The missing ones’ children still remember those backs: between hearth and doorstep, they walked into the trees. Memory is an unfinished letter—neither mailed nor torn away.",
    "p10": "Years passed; the children grew. Softness receded; resolve took shape. Their parents’ fate matured into a riddle: what happened inside the forest; why no word for years?",
    "p11": "They know answers come only on Halloween—so on October 31, while the village feasts, they slip into the Black Forest to seek the lost trail and the lost people.",
    "p12": "A half-real medieval countryside where horror overlaps with folklore, fog contends with order; the story updates the same day each year. The forest is not a place but a path toward truth and price."
  },
  "theatre": {
    "greet": "Stories of the Children",
    "titles": [
      "Child of the Botanist: Emily Greenwood",
      "Child of the Forest Explorer: Thomas Hawthorne",
      "Child of the Antiquity Scholar: Lillian Noble",
      "Child of the Monster Researcher: Sebastian Mohr"
    ],
    "emily_greenwood": {
      "chapter-title": "IV · The Botanist’s Child",
      "p01": "“Emily, look—these seeds differ in color and shape. Can you tell?”\n\n“That should be pumpkin. When Mom made pumpkin pie, she scooped out seeds just like these.”",
      "p02": "“Haha, worthy of the Greenwood name!”\n\n“Of course! Our Emily is the smartest, right?”\n\n“Mm! I love watching plants grow!”",
      "p03": "“Sweetheart, you’ll grow like a seed into a towering tree.”\n\n“Dad, what kind of tree is ‘towering’?”\n\n“That depends on which you like.”",
      "p04": "“Hmm… I like the ones in the Black Forest! We never have such strange trees in the village.”\n\n“The Black Forest… yes, its trees aren’t like ours.”",
      "p05": "“But you’re not interested in other trees?”\n\n“I am! I want to study their ‘magic’ like you!”\n\n“Haha, I believe you will.”"
    },
    "thomas_hawthorne": {
      "chapter-title": "The Forest Explorer’s Child · Thomas",
      "p01": "“Ha… ha… run! Imagine a monster behind you!”\n“I’m tired, Dad… I want a break…”",
      "p02": "“Break? Will monsters in the Black Forest let you rest? One more lap if you can’t run!”\n“But Dad, I saw it! I escaped its claws!”",
      "p03": "“That’s only escape. Learn to handle it. I don’t expect you to defeat it, but I won’t have you end up like your mother—paralyzed. Understand?”\n“Okay…”",
      "p04": "“Good. My life’s experience will be yours—be the explorer who protects others, not the one who exposes them.”\n“I’ll train hard.”",
      "p05": "“Tonight: your favorite bolognese. Double the meat.”\n“Great! Eat big, grow big!”"
    },
    "lillian_noble": {
      "chapter-title": "The Antiquity Scholar’s Child · Lillian",
      "p01": "“From antiquity, monsters protected altars from humans… because—”\n“Because altars have power against them.”",
      "p02": "“Mom? When did you come in?”\n“When you reached chapter three, line fourteen.”\n“How did you know?”\n“I wrote that book.”",
      "p03": "“I remember, but… sometimes your memory feels ‘ancient’.”\n“Isn’t ‘ancient’ what we study?”",
      "p04": "“When I grow up, I’ll research you.”\n“Hey, hey, I’m not a specimen!”\n“It’s just your head resembles a mummy.”\n“You mean like a pharaoh—brilliant?”",
      "p05": "“Maybe.”\n“What do you mean maybe!”\n“Kidding. You’re much smarter than me; if I ever discover a new civilization, it’ll be thanks to you.”"
    },
    "sebastian_mohr": {
      "chapter-title": "The Monster Researcher’s Child · Sebastian",
      "p01": "“Sebas! Where did you hide again?”—“Tch, annoying.”—“I knew it! Why skip study every day?”",
      "p02": "“I want to know what dangerous stuff you do each day.” — “That’s my job; kids don’t get it.” — “Don’t get it? The whole village knows you’re a ‘hero.’”",
      "p03": "“You throw yourself into the forest’s danger—ever think about Mom and me?” — “I study them for you, so you don’t end up like our neighbor—never to stand again.”",
      "p04": "“Don’t say that about his mom! He’s my friend!” — “They face monsters without knowing them; the village is safer.” — “I disagree. He’s trying to protect his mom.”",
      "p05": "“And you? You should help guard the village. Fear makes him stand and face things; you’re running. Get strong, hone yourself—be tough wood, not rot.”"
    }
  },
  "kids": {
    "greet": "Little hero, will you glow tonight?",
    "chapter-title": "V · Kids Faction Gameplay",
    "chapter-blurb": "The main goal is simple: bully a pumpkin from “seed” into a “glowing head,” then respectfully place three of those heads on the altar—in that order.",
    "p01": "Overview (safe, not necessarily comfortable): Haystack → Greenhouse → Carving Bench → Ignition Pedestal → Altar ×3 → Victory. The arrows aren’t for show—follow them.",
    "p02": "Step 1 · Haystack: reach into the fluffy unknown and search for seeds. Normally you’ll touch seeds; abnormally you’ll touch a hand that isn’t yours—relax, usually a teammate’s.",
    "p03": "Pro tip: ⬛️⬛️⬛️’s “Green Thumb” shines here—better seeds, shorter time. Others can search too, with efficiency proportional to their psychological shadow area.",
    "p04": "Step 2 · Greenhouse Rush: settle seeds inside and let them sprint. The greenhouse is the gentlest place in town—except for the straw silhouette peeking through glass now and then. Stay quiet; don’t let plants hear you growing.",
    "p05": "Greenhouse trick: if a “Focus Check” triggers, don’t panic—pass it and you’re the fertilizer; fail it and the plant drinks your chicken soup. ⬛️⬛️⬛️ reduces incidents here.",
    "p06": "Step 3 · Carving Bench: give the ripe pumpkin a face. Aim for cute; don’t carve your math teacher. Watch your HP—not the pumpkin’s, yours.",
    "p07": "Art director’s note: ⬛️⬛️⬛️ knows odd symbols. Carve them and it may glow brighter… or start talking. Both are festive.",
    "p08": "Step 4 · Ignition Pedestal: light the soul-flame. The color looks freshly health-checked; the heat guides and exposes. Move quickly after lighting to avoid being the lighthouse.",
    "p09": "Logistics: lit lanterns attract “patrolling friends.” ⬛️⬛️⬛️ tracks well and runs quiet—great carrier; ⬛️⬛️⬛️, if caught, might dodge—if not, he runs faster.",
    "p10": "Step 5 · Altar: place the lantern in the recess and listen for the click. Each offering makes the forest cough. Gather three and a door opens (destination not guaranteed).",
    "p11": "Team play: one carries, one scouts, one clears. Do not lock eyes with the scarecrow—its gaze is a deadline; the longer you look, the less you move.",
    "p12": "Win: three lanterns seated, altar powers up, night wind sweetens, the village bell lags behind your heartbeat—meaning you lived to win. Note: winning isn’t safety; safety is tonight’s alias.",
    "p13": "Failure (for practicing gallows humor): pumpkin stomped mid-route; you set yourself on fire; queue at the altar on the wrong timeline. Don’t worry—by round three it becomes a legend.",
    "p14": "Coward’s tip: laugh first, run after. If straw crackles in your ear, it’s close—compliment its hairstyle. Politeness sometimes beats speed."
  },
  "overseer": {
    "greet": "Night is in position. So are you.",
    "chapter-title": "VI · Monster Faction Gameplay",
    "chapter-blurb": "The scarecrow does not chase.\nIt only waits.\nAt the right place.\nAt the right time.\nSee the item.\nJudge the destination.\nBecome a shadow on the road first.\n\nOnly thus\ndoes straw endure.",
    "p01": "The flowchart belongs neither to them nor to you—it belongs to the night. Your task is to be a cold nail at every chokepoint.",
    "p02": "Lead with hearing: the rustle of hay, glass echo, knife on rind, flame inhaling, altar latch—all tell you the next step.",
    "p03": "Hold Point I · Haystack: if the first sound is a fuzzy “shhh,” they’re groping for seeds. Guard the retreat, not the front. Let them leave with fear and return with more.",
    "p04": "Hold Point II · Greenhouse: glass quivers, fog breaks. That’s not wind; that’s growth. Wait in the doorway’s shadow for the instant their focus fails. Some will look up and see only your second blink.",
    "p05": "Hold Point III · Carving Bench: knife and rind sing a thin song. The steadier the tune, the tighter their nerves. Approach; don’t interrupt. Let them carve the opening, then harvest.",
    "p06": "Hold Point IV · Ignition: when the flame bites air, that’s the horn. Light shows them the road and shows you them. Don’t rush; the light will evict their hiding places for you.",
    "p07": "Hold Point V · Altar: all footsteps converge here. Before the third click, any hesitation is a crack. Stand between the ‘cl’ and the ‘ick.’",
    "p08": "Carry detection: empty-handed look at the ground; lantern-bearers stare into dark. Watch the shoulders—the heavier side points to the next stop. Watch the feet—careful steps mean they hold light.",
    "p09": "Path inference: Hay → Greenhouse → Carve → Ignite → Altar. If disrupted, next time they choose shorter route, brighter path, nearer ally. Place your shadow on those “more”s.",
    "p10": "Patrol rule: pace only between two points. Don’t triangulate your doubt. You are a latch, not a wind chime.",
    "p11": "Gaze (Terror Gaze): choose the carrier. Lower their speed, raise their pulse. Slow is farewell.",
    "p12": "Decoy (Straw Rebirth): when they think they’ve won, leave a husk and move elsewhere. The match ends when they look back.",
    "p13": "Bait: retreat two steps; leave a slit. They’ll call it a way out and deliver the light into your arms.",
    "p14": "Reckoning: if three lights align, you lose tonight. Shatter any one, and the night will supply the rest of the dark.",
    "p15": "Maxim: do not chase—let them run to you. Do not shout—let them call the points for you. Do not pity—pity germinates into their tomorrow.",
    "p16": "Coda: to guard is a slow beheading. When the last latch falls silent, the forest writes your name back into fog. Stay at the correct place and tomorrow will not arrive.",
    "p17": "Boards: if children drop planks to block you, you may kick them apart. It is slow and shrill, slicing the night into thinner sheets. It takes a long time, but it breaks. Delay only stretches fear.",
    "p18": "Cleanup: you may “tidy up” the junk they scatter. Not sorting—erasure. Objects on the route vanish as if never placed. They find no handle behind and no path ahead. The night enjoys such order."
  },
  "design": {
    "greet": "Some pretty decent AI design"
  },
  "future": {
    "greet": "Message for Tomorrow",
    "p01": "Try giving characters richer skills—ideally raise quality so co-op feels better to play.",
    "p02": "Plenty of bugs—well, it was made in 3×48 hours, haha.",
    "p03": "And now, im gonna sleep. Good night (morning)."
  }
}
